bitcraze/crazyflie-firmware/lib/STM32_CPAL_Driver/devices/stm32f10x/cpal_i2c_hal_stm32f10x.h
/**
  *********************************************************************************
  * @file    Libraries/STM32_CPAL_Driver/devices/stm32f10x/cpal_i2c_hal_stm32f10x.h
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    21-December-2012
  * @brief   This file contains all the functions prototypes for the CPAL_I2C_HAL 
  *          firmware layer.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef ___CPAL_I2C_HAL_STM32F10X_H
#define ___CPAL_I2C_HAL_STM32F10X_H

#ifdef __cplusplus
extern "C" {
#endif
  
/* Includes ------------------------------------------------------------------*/
/*========= STM32 Standard library files includes =========*/
#include "stm32f10x.h"
#include "stm32f10x_i2c.h"  
#include "stm32f10x_dma.h" 
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "misc.h"
  
/*========= CPAL library files includes =========*/
#include "cpal.h" 

 
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
  
/*======================================================================================================================================
                                                 CPAL Hardware Configuration 
========================================================================================================================================*/

/*  ------ Configure the communication device and all related peripherals ( GPIO Pin, DMA Channels, 
            NVIC Priority) with this file, by referring to configuration Sections:
  
                - Section 1 : Select the pins to be used for each device instance.
  
                - Section 2 : Select TX and RX DMA Channels (if DMA mode will be used).
  
                - Section 3 : Set device's Events, Errors and DMA Interrupts Priorities.                   */
  
  
/*-----------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------*/

/*    -- Section 1 :                 **** Device IO Pins Selection ****
  
  Description: This section allows user to choose IO Pins for each device if possible (in accordance with 
               used product: some products have only one possibility for the IO pins).
               Each device instance (I2C1, I2C2 ..) has its specific defines: one for each Pin.
               For each device instance, you will change existing defines with adequate IO Pins and Port 
               ( Refer to Product Pin mapping in related datasheet). */
 
/* To configure SCL and SDA Pin change these defines with adequate value :
  
#define CPAL_I2C1_SCL_GPIO_PORT         GPIOX                  (X : Name of the GPIO PORT  (A,B,C,....))     
#define CPAL_I2C1_SCL_GPIO_CLK          RCC_APB2Periph_GPIOX   (X : Name of the GPIO PORT  (A,B,C,....))   
#define CPAL_I2C1_SCL_GPIO_PIN          GPIO_Pin_X             (X : Pin number (1,2,3,....))   
  
#define CPAL_I2C1_SDA_GPIO_PORT         GPIOX                  (X : Name of the GPIO PORT  (A,B,C,....)) 
#define CPAL_I2C1_SDA_GPIO_CLK          RCC_APB2Periph_GPIOX   (X : Name of the GPIO PORT  (A,B,C,....))  
#define CPAL_I2C1_SDA_GPIO_PIN          GPIO_Pin_X             (X : Pin number (1,2,3,....))                         */
   

/* IO Pins selection possibilities 
  
|--------|---------|--------------|-----------|-------------------------|
| Device | I2C PIN |   GPIO_PIN   | GPIO_PORT |         GPIO_CLK        |                                          
|--------|---------|--------------|-----------|-------------------------|
|        |         |  GPIO_Pin_6  |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|        |   SCL   |--------------|-----------|-------------------------|
|        |         |  GPIO_Pin_8  |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|  I2C1  |---------|--------------|-----------|-------------------------|
|        |         |  GPIO_Pin_7  |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|        |   SDA   |--------------|-----------|-------------------------|
|        |         |  GPIO_Pin_9  |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|--------|---------|--------------|-----------|-------------------------|
|        |   SCL   |  GPIO_Pin_10 |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|  I2C2  |---------|--------------|-----------|-------------------------|
|        |   SDA   |  GPIO_Pin_11 |   GPIOB   |  RCC_APB2Periph_GPIOB   |                                          
|--------|---------|--------------|-----------|-------------------------|    
  Note: For this family, there are only two possible configurations for I2C1:
    - Configuration 1: I2C1_SCL = PB06 and I2C1_SDA = PB07
    - Configurating 2: I2C1_SCL = PB08 and I2C1_SDA = PB09
   It is not possible to mix these configuration.
  
  */ 
  
  
/*----------- I2C1 Device -----------*/
/* For STM32F10x family there are two possible configurations of I2C1 pins:
         1- SCL --> Pin PB6 and SDA --> Pin PB7 
         2- SCL --> Pin PB8 and SDA --> Pin PB9 */
  
#define CPAL_I2C1_SCL_GPIO_PORT         GPIOB       
#define CPAL_I2C1_SCL_GPIO_CLK          RCC_APB2Periph_GPIOB 
#define CPAL_I2C1_SCL_GPIO_PIN          GPIO_Pin_6
  
#define CPAL_I2C1_SDA_GPIO_PORT         GPIOB       
#define CPAL_I2C1_SDA_GPIO_CLK          RCC_APB2Periph_GPIOB 
#define CPAL_I2C1_SDA_GPIO_PIN          GPIO_Pin_7 
 
  
/*-----------I2C2 Device -----------*/
/* I2C2 Pins are defined as below :   
         1- SCL --> Pin PB10 and SDA --> Pin PB11 */
  
#define CPAL_I2C2_SCL_GPIO_PORT         GPIOB       
#define CPAL_I2C2_SCL_GPIO_CLK          RCC_APB2Periph_GPIOB 
#define CPAL_I2C2_SCL_GPIO_PIN          GPIO_Pin_10
  
#define CPAL_I2C2_SDA_GPIO_PORT         GPIOB       
#define CPAL_I2C2_SDA_GPIO_CLK          RCC_APB2Periph_GPIOB 
#define CPAL_I2C2_SDA_GPIO_PIN          GPIO_Pin_11 
 
  
/*-----------------------------------------------------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------------------------------------------------*/

/*    -- Section 2 :           **** Device TX and RX DMA Channels Selection ****
  
  Description: This section allows user to choose TX and RX DMA Channels if possible (in accordance with 
               used product) for each device.
               Each device instance (I2C1, I2C2 ..) has its specific defines: one for DMA TX Channel and 
               another one for DMA RX Channel.
               For each device instance, you find all TX an RX DMA Channel possibilities ( Refer to Product
               Reference Manual).*/
 
